In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("employee_data.csv")
df

     Unnamed: 0   id groups  age  healthy_eating  active_lifestyle  salary
0             0    0      A   36               5                 5    2297
1             1    1      A   55               3                 5    1134
2             2    2      A   61               8                 1    4969
3             3    3      O   29               3                 6     902
4             4    4      O   34               6                 2    3574
..          ...  ...    ...  ...             ...               ...     ...
995         995  995      O   33               7                 7    2996
996         996  996      O   21               1                 2     667
997         997  997      O   49               9                 7    4158
998         998  998     AB   56               6                 7    2414
999         999  999      B   64               4                 9     788

[1000 rows x 7 columns]

In [3]:
df.shape

(1000, 7)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        1000 non-null   int64
 1   id                1000 non-null   int64
 2   groups            1000 non-null   object
 3   age               1000 non-null   int64
 4   healthy_eating    1000 non-null   int64
 5   active_lifestyle  1000 non-null   int64
 6   salary            1000 non-null   int64
dtypes: int64(6), object(1)
memory usage: 54.8+ KB

In [5]:
df['salary']

0      2297
1      1134
2      4969
3       902
4      3574
       ...
995    2996
996     667
997    4158
998    2414
999     788
Name: salary, Length: 1000, dtype: int64

In [6]:
df['salary'].mean()

2227.461

In [7]:
df['salary'].min()
df['salary'].max()

5550

In [8]:
df['salary'].median()

2174.0

In [9]:
df['salary'].min()

553

In [10]:
df['groups'].value_counts()

A     375
O     375
AB    125
B     125
Name: groups, dtype: int64

In [11]:
df['salary'].std()

1080.2097600024754

In [12]:
df['salary'].var()

1166853.1256046053

In [ ]:
df[salary].